class TextTemplates:
    template_for_mailing = "Привет, Сияющий! \nТебе сообщение от {author} \n {message}"
    message_before_auth = ("Привет, сияющий✨\n"
                           "Добро пожаловать в бот мероприятий ОПГ Сияния\n"
                           "Данный бот нужен для того, чтобы ты вовремя узнавал обо всех играх и встречах Сияющих, будь то кино, путешествие или что-то ещё 🔥)\n"
                           "Обещаем в этом боте слать сообщения только по делу 🦀\n"
                           "Давай же познакомимся!\n"
                           "Нажми на кнопку 'Авторизоваться' ниже, чтобы начать использовать бота")
    message_after_auth = "Приятно познакомиться :)\nДо встречи👋"
    message_already_auth = "Оказывается, мы уже знакомы! Давай продолжим совместную работу!"